{
    "information": {
        "name": "Sebastian",
        "last_name": "Romero",
        "github": "sebasromero",
        "github_url": "https://github.com/sebasromero",
        "linkedin":"sebasromerog",
        "linkedin_url":"https://linkedin.com/in/sebasromerog",
        "email": "sebastian_engineer@hotmail.com"
    },
    "work_experience": [
        {
            "company": "OpenBox (Remote)",
            "position":"Software Engineer",
            "date": "Aug 2024 - Jan 2025",
            "bullets": {
                "bullet1": "Deployed and configured the backend infrastructure on AWS EC2 with Nginx, ensuring stable performance and secure connections by integrating Cloudflare for TLS encryption.",
                "bullet2": "Integrated PayPal as a payment gateway, enabling seamless online transactions and improving the user purchase experience.",
                "bullet3": "Developed a WebSocket-based real-time data synchronization feature using JavaScript and TypeScript, reducing latency and improving responsiveness for users.",
                "bullet4": "Designed and implemented a MongoDB database optimized for high-volume transactions, ensuring reliable data storage and accessibility."
            },
            "tools": ["AWS","EC2", "SES", "NestJS", "NodeJS", "MongoDB", "Golang", "Nginx", "Docker", "Cloudflare", "REST", "Stripe"]
        },
        {
            "company": "Coderlabs (Remote)",
            "position": "Software Engineer",
            "date": "Jul 2023 - Jun 2024",
            "bullets": {
                "bullet1": "Built a role-based authentication and authorization system with Node.js, improving user security and access control.",
                "bullet2": "Led the integration of MercadoPago as a payment gateway for subscription purchases, using JavaScript, TypeScript, Node.js, GraphQL and MongoDB increasing application revenue by 100% within 2 months of launch.",
                "bullet3": "Led the redesign of the company website using Astro, React.js, and Tailwind CSS, improving performance and usability for over 300 monthly users.",
                "bullet4": "Played a key role in redesigning the company website with over 300 monthly users using Astro, JavaScript, TypeScript, React.js, and Tailwind CSS, improving usability and performance.",
                "bullet5": "Integrated unit tests using Jest, resolving interoperability issues and enhancing product reliability by 80% due to test coverage, with over 55 test cases.",
                "bullet6": "Maintained effective communication with clients, aligning requirements to improve product features and meet delivery deadlines through sprints every 2 weeks using Agile Methodology."
            },
            "tools": ["NestJS","MongoDB", "GraphQL", "AWS", "Golang", "NodeJS", "React", "Tailwind CSS", "Astro", "GraphQL", "AWS", "Jest"]    
        }
    ]
}